src/Catalogs/ВнешниеСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВнешниеСистемы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторизацияПоКодуБезСМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Comment>Внешняя система используется</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючПриложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючШифрования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючШифрованияОбратногоЗвонка</Name>
					<Comment>Используется для обратного звонка в CRM</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Синхронизирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВнешнейСистемы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВнешнихСистем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТокенДоступа</Name>
					<Comment>Используется для отправки Push уведомлений</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УправлениеВЛичномКабинете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ТипыВнешнихСистем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыВнешнихСистем</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Calltouch</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Chat2Desk</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CoMagic</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>GreenApi</Name>
					<Comment>WhatsApp</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>IPТелефония</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>JivoSite</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Marquiz</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Roistat</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TapLink</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Telegram</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Tilda</Name>
					<Comment>Ловец лидов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Viber</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Vkontakte</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>VkontakteApi</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Wallet</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Webhook</Name>
					<Comment>Получение лидов стандартный набор параметров</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВиджетОнлайнЗаписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИЭМК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтурСтрахование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МобильноеПриложениеУправляющего</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОценкиИОтзывы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроДокторов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексКарты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексМетрика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СистемаБыстрыхПлатежей</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоциальнаяСеть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МобильноеПриложение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КороткийАдрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Координаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексКарты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексОтзывы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ВнешниеСистемы/Forms/ФормаЭлементаЯндексКарты/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		Параметры.Свойство("ТипВнешнейСистемы", Объект.ТипВнешнейСистемы);
		Объект.КлючПриложения = Новый УникальныйИдентификатор();
		СформироватьНаименование(); 
		Элементы.ГруппаУдалить.Видимость 		 = Ложь;
	Иначе
		ПараметрыВнешнейСистемы = Объект.Ссылка.Параметры.Получить();		
	КонецЕсли;
	СтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	Объект.СтруктурнаяЕдиница = СтруктурнаяЕдиница; 
	СтруктурнаяЕдиницаПриИзмененииНаСервере();
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
КонецПроцедуры

// Процедура, формирует наименование.
//
Процедура СформироватьНаименование() 
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВнешниеСистемы.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ВнешниеСистемы КАК ВнешниеСистемы
	|ГДЕ
	|	ВнешниеСистемы.ТипВнешнейСистемы = &ТипВнешнейСистемы");
	
	Запрос.УстановитьПараметр("ТипВнешнейСистемы", Объект.ТипВнешнейСистемы);
	
	ТаблицаВнешнихСистем = Запрос.Выполнить().Выгрузить();
	
	Объект.Наименование = Строка(Объект.ТипВнешнейСистемы) + ?(ТаблицаВнешнихСистем.Количество() > 1, "-" + Строка(ТаблицаВнешнихСистем.Количество()), ""); 
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "СоздатьКлюч" 
//
Процедура СоздатьКлюч(Команда)
	
	Объект.КлючПриложения = Строка(Новый УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
// Процедура - проверяет ответ
//
Процедура ЗаписатьОбъектОтвет(РезультатВопроса, Параметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Результат = ЭтаФорма.Записать();
		Если Не Результат Тогда
			Возврат;
		КонецЕсли;				
	Иначе
		СтруктурнаяЕдиница = Объект.СтруктурнаяЕдиница;
		Возврат;
	КонецЕсли;
	СтруктурнаяЕдиницаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
// Процедура - структерная единица при изменении на сервере
//
Процедура СтруктурнаяЕдиницаПриИзмененииНаСервере()
	
	Элементы.КомандыДобавленияКонтактнойИнформации.Видимость     = Истина;
	Элементы.КомандаПодобратьИдентификаторРубрики.Видимость      = Истина;
	Элементы.ГруппаНастройкиОнлайнЗаписиПравваяКолонка.Видимость = Истина;
	
	СЕ = СтруктурнаяЕдиница.ПолучитьОбъект();
	// Контактная информация
	УправлениеКонтактнойИнформациейСтоматология.ПриСозданииПриЧтенииНаСервере(ЭтотОбъект, СЕ);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
		
	ИспользоватьЯндексКарты = СЕ.ИспользоватьЯндексКарты;
	
	Если ИспользоватьЯндексКарты Тогда
		ЯндексИдентификаторРубрики = СЕ.НастройкиЯндексКарты.Получить().ИдентификаторРубрики;
		Элементы.ГруппаЯндексИдентификаторРубрики.Видимость = Истина;
	Иначе
		Элементы.ГруппаЯндексИдентификаторРубрики.Видимость = Ложь;
	КонецЕсли;
	
	УдалитьДинамическиеЭлементы(Элементы.ГруппаРубрики, Элементы.ГруппаРубрика_Шаблон);
	ПостроитьДинамическиеЭлементы();
	ОтобразитьКартинки();
	
КонецПроцедуры

&НаКлиенте
// Процедура - структурная единица при изменении
//
Процедура СтруктурнаяЕдиницаПриИзменении(Элемент)
	
	Если ЭтаФорма.Модифицированность Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаписатьОбъектОтвет", ЭтотОбъект), Нстр("ru='Для продолжения операции необходимо записать элемент, записать?';en='For continued operations is necessary writedown element writedown?'"), РежимДиалогаВопрос.ДаНет);
	Иначе
		СтруктурнаяЕдиницаПриИзмененииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Добавить контактную информацию
// 
// Параметры:
//  Команда	 - 	 - 
// 
Процедура ДобавитьКонтактнуюИнформацию(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьКонтактнуюИнформациюВидВыбран", ЭтотОбъект);
	СписокДоступныхВидов = УправлениеКонтактнойИнформациейКлиентСерверСтоматология.СписокВидовДляДобавленияКонтактнойИнформации(ЭтаФорма.СвойстваВидовКонтактнойИнформации, ЭтаФорма.КонтактнаяИнформация);
	ЭтаФорма.ПоказатьВыборИзМеню(ОписаниеОповещения, СписокДоступныхВидов, Элементы.КнопкаДобавитьКонтактнуюИнформацию);
	
КонецПроцедуры 

&НаКлиенте
// Процедура - обработчик оповещения "ДобавитьКонтактнуюИнформациюВидВыбран".
//
Процедура ДобавитьКонтактнуюИнформациюВидВыбран(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура("Вид", ВыбранныйЭлемент.Значение);
	
	НайденныеСтроки = ЭтаФорма.СвойстваВидовКонтактнойИнформации.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	СвойстваВида = НайденныеСтроки[0];
	
	ДобавитьКонтактнуюИнформациюСервер(ВыбранныйЭлемент.Значение);
	
КонецПроцедуры

&НаСервере
// Процедура - Добавить контактную информацию сервер
//
// Параметры:
//  ДобавляемыйВид				 - 	 - 
//  УстановитьВыводВФормеВсегда	 - 	 - 
//
Процедура ДобавитьКонтактнуюИнформациюСервер(ДобавляемыйВид, УстановитьВыводВФормеВсегда = Ложь) Экспорт
	
	УправлениеКонтактнойИнформациейСтоматология.ДобавитьКонтактнуюИнформацию(ЭтаФорма, Объект, ДобавляемыйВид, УстановитьВыводВФормеВсегда);
	
КонецПроцедуры

&НаСервере
// Процедура - перед записью на сервере
//
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(Объект.СтруктурнаяЕдиница) Тогда
		ОбъектСЕ = Объект.СтруктурнаяЕдиница.ПолучитьОбъект();
		
		// КонтактнаяИнформация
		УправлениеКонтактнойИнформациейСтоматология.ПередЗаписьюНаСервере(ЭтотОбъект, ОбъектСЕ);
		// Конец КонтактнаяИнформация
		НастройкиЯндекса = ОбъектСЕ.НастройкиЯндексКарты.Получить();
		НастройкиЯндекса.ИдентификаторРубрики = ЭтотОбъект.ЯндексИдентификаторРубрики.Скопировать();
		Если ОбъектСЕ.ИспользоватьЯндексКарты = ИспользоватьЯндексКарты Тогда
			ОтправитьВЦРМ = Ложь; 
		Иначе
			ОтправитьВЦРМ = Истина;
		КонецЕсли;
		ОбъектСЕ.ИспользоватьЯндексКарты = ИспользоватьЯндексКарты;
		ОбъектСЕ.ДополнительныеСвойства.Вставить("НастройкиЯндексКарты", НастройкиЯндекса);
		ОбъектСЕ.Записать();
		
		Если (ЭтаФорма.Модифицированность И ИспользоватьЯндексКарты) Или ОтправитьВЦРМ Тогда
			
			ЯндексЧасыРаботы							= Справочники.СтруктурныеЕдиницы.ПолучитьПредставленияГрафикаРаботы(ОбъектСЕ);
			Если Не ЗначениеЗаполнено(ЯндексЧасыРаботы) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("На вкладке Основное не заполнено - Время работы");
				Отказ = Истина;
				Возврат;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ЯндексСайт) И Не (Лев(ЯндексСайт, 7) = "http://" Или Лев(ЯндексСайт, 8) = "https://") Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Основной сайт сети. Указывается в нижнем регистре, полностью, включая http:// или https://");
				Отказ = Истина;
				Возврат;
			КонецЕсли;

			Если Не ЗначениеЗаполнено(ЯндексИдентификаторРубрики) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо добавить от 1 до 3 рубрик");
				Отказ = Истина;
				Возврат;
			КонецЕсли;

			ЯндексНомерОбласти = ЛичныйКабинет.ПолучитьНомерОбласти();
			
			ВнешняяСистема = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(,Перечисления.ТипыВнешнихСистем.ЯндексКарты, ЛОжь); 
			
			Если НЕ ЗначениеЗаполнено(ВнешняяСистема) Тогда			
				ВнешняяСистема = Справочники.ВнешниеСистемы.СоздатьВнешнююСистему(Перечисления.ТипыВнешнихСистем.ЯндексКарты,,Объект.Наименование);
			КонецЕсли;	
			ЯндексКлючВнешнейСистемы = НРег(ВнешняяСистема.КлючПриложения);
			
			ПараметрыЗапроса = Новый Структура();
			
			МассивТелефоновЯ 							= ОбъектСЕ.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон));
			МассивЭлПочтыЯ 								= ОбъектСЕ.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)); 
			МассивСоциальныхСетейЯ                      = ОбъектСЕ.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.СоциальнаяСеть));
			МассивАдресовЯ 								= ОбъектСЕ.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес));
			
			Если ЗначениеЗаполнено(МассивТелефоновЯ)
				И ЗначениеЗаполнено(МассивТелефоновЯ[0].Значение) 
				И ЗначениеЗаполнено(МассивАдресовЯ)
				И ЗначениеЗаполнено(МассивАдресовЯ[0].Значение)
				И ЗначениеЗаполнено(НастройкиЯндекса.Сайт) Тогда
				
				МассивАдресовФакт						= ДекодироватьИзJSON(МассивАдресовЯ[0].Значение);
				ЯндексАдрес 							= МассивАдресовФакт.value;
				ЯндексДополнительнаяИнформацияКАдресу 	= ?(МассивАдресовФакт.Свойство("comment"), МассивАдресовФакт.comment, "");
				ЯндексГород 							= ?(МассивАдресовФакт.Свойство("city"), МассивАдресовФакт.city, "");
				Если НЕ ЗначениеЗаполнено(ЯндексГород) Тогда
					ЯндексГород = МассивАдресовФакт.area;	
				КонецЕсли;
				
				Если ЗначениеЗаполнено(МассивАдресовЯ) 
					И МассивАдресовЯ.Количество() > 1 
					И ЗначениеЗаполнено(МассивАдресовЯ[1].Значение) Тогда
					МассивКороткихАдресов			= ДекодироватьИзJSON(МассивАдресовЯ[1].Значение);
					ЯндексКороткийАдрес 			= МассивКороткихАдресов.value;
				Иначе
					ЯндексКороткийАдрес = "";
				КонецЕсли;
				
				
				МассивТелефонов = Новый Массив;
				Для Каждого СтрокаТ Из МассивТелефоновЯ Цикл
					
					СтруктураСтроки = Новый Структура("НомерТелефона, ДобавочныйНомер, ЧейНомер");
					ЗаполнитьЗначенияСвойств(СтруктураСтроки, СтрокаТ);
					МассивТелефонов.Добавить(СтруктураСтроки);
					
				КонецЦикла;
				ПараметрыЗапроса.Вставить("yandextelsp"		, МассивТелефонов);
				
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заполните обязательные поля - Телефон, фактический адрес и сайт");
				Отказ = Истина;
				Возврат;
			КонецЕсли;
			УидТекущейСессии = ЛичныйКабинет.УидТекущейСессии();
			ПараметрыЗапроса.Вставить("session"				, УидТекущейСессии);
			ПараметрыЗапроса.Вставить("structuralunit"		, СтрЗаменить(Строка(ОбъектСЕ.Ссылка.УникальныйИдентификатор()), "-", ""));
			ПараметрыЗапроса.Вставить("name"				, Строка(ОбъектСЕ.Организация));
			ПараметрыЗапроса.Вставить("yandexadress"		, ЯндексАдрес);
			ПараметрыЗапроса.Вставить("yandexaddadress"		, ЯндексДополнительнаяИнформацияКАдресу);
			ПараметрыЗапроса.Вставить("yandexaddsite"		, НРег(НастройкиЯндекса.ДополнительныйСайт));
			ПараметрыЗапроса.Вставить("yandexinn"			, ОбъектСЕ.Организация.ИНН);
			ПараметрыЗапроса.Вставить("yandexsalon"			, НастройкиЯндекса.Салон);
			ПараметрыЗапроса.Вставить("yandexogrn"			, ОбъектСЕ.Организация.ОГРН);
			ПараметрыЗапроса.Вставить("yandexsite"			, НРег(НастройкиЯндекса.Сайт));
			ПараметрыЗапроса.Вставить("yandexfoto"			, НРег(НастройкиЯндекса.СсылкаНаФото));
			ПараметрыЗапроса.Вставить("yandexstrana"		, Строка(Константы.СтранаУчета.Получить()));
			ПараметрыЗапроса.Вставить("yandextime"			, НастройкиЯндекса.ЧасыРаботы);
			ПараметрыЗапроса.Вставить("yandexdata"			, Строка(Формат(ТекущаяДатаСеанса(), "ДЛФ=D")));
			ПараметрыЗапроса.Вставить("yandexgorod"			, ЯндексГород);
			ПараметрыЗапроса.Вставить("yandexstatus"		, ИспользоватьЯндексКарты);
			ПараметрыЗапроса.Вставить("yandexkey"			, ЭтаФорма.ЯндексКлючВнешнейСистемы);
			ПараметрыЗапроса.Вставить("yandexobl"			, ЯндексНомерОбласти);
			ПараметрыЗапроса.Вставить("yandexstructura"		, НастройкиЯндекса.Салон);
			ПараметрыЗапроса.Вставить("yandexshortadres"	, ЯндексКороткийАдрес);
			
			ПараметрыЗапроса.Вставить("yandextip"			, "2");   // 0 - Салон красоты, 1 - Фитнес, 2 - Стоматология
			
			РезультатЗапроса = ЛичныйКабинет.СоздатьВнешнююСистемуВ_CRM(ВнешняяСистема, УидТекущейСессии);
			
			МассивЯндексРубрик = Новый Массив;
			Для Каждого СтрокаТ Из ЯндексИдентификаторРубрики Цикл
				МассивЯндексРубрик.Добавить(СтрокаТ.Значение);	
			КонецЦикла;
			ПараметрыЗапроса.Вставить("yandexrubrika" , МассивЯндексРубрик);
			
			МассивКартинок = Новый Массив;
			
			Индекс = 0;
			Для Каждого СтрокаТ Из ЭтаФорма.ФайлыКартинок Цикл
				ФайлКартинки  = ЭтотОбъект.ФайлыКартинок[Индекс].Значение;				
				БазовыйURL    = "http://app.stoma1c.ru/api/hs/api";
				АдресКартинки = БазовыйURL + "/files/" + ВнешняяСистема.КлючПриложения + "/" + Строка(ФайлКартинки.УникальныйИдентификатор()) + "." + ФайлКартинки.Расширение;
				ЭтотОбъект.ФайлыКартинок[Индекс].Представление = АдресКартинки;
				Индекс = Индекс + 1; 
				МассивКартинок.Добавить(АдресКартинки);	
			КонецЦикла;
			
			ПараметрыЗапроса.Вставить("yandexkartinki" , МассивКартинок);
			
			МассивЯндексЭлПочты = Новый Массив;
			Для Каждого СтрокаТ Из МассивЭлПочтыЯ Цикл
				МассивЯндексЭлПочты.Добавить(СтрокаТ.Представление);	
			КонецЦикла;
			ПараметрыЗапроса.Вставить("yandexmailsp" , МассивЯндексЭлПочты);

			
			МассивЯндексСоциальныеСети = Новый Массив;
			Для Каждого СтрокаТ Из МассивСоциальныхСетейЯ Цикл
				МассивЯндексСоциальныеСети.Добавить(СтрокаТ.Представление);	
			КонецЦикла;
			ПараметрыЗапроса.Вставить("yandexsitesp" , МассивЯндексСоциальныеСети);
			
			РезультатЗапроса = ЛичныйКабинет.ОтправитьДанныеЯндексКартыВCRM(ПараметрыЗапроса);
			
			Если РезультатЗапроса.ВыполненоУспешно Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Данные переданы для обработки!");
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Произошла ошибка, попробуйте еще раз!");
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

&НаКлиенте
// Процедура - Подключаемый действие КИНажатие
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура Подключаемый_ДействиеКИНажатие(Элемент)
	
	УправлениеКонтактнойИнформациейКлиентСтоматология.ДействиеКИНажатие(ЭтотОбъект, Элемент);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый представление КИПри изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура Подключаемый_ПредставлениеКИПриИзменении(Элемент)
	
	УправлениеКонтактнойИнформациейКлиентСтоматология.ПредставлениеКИПриИзменении(ЭтотОбъект, Элемент);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый представление КИНачало выбора
//
// Параметры:
//  Элемент				 - 	 - 
//  ДанныеВыбора		 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура Подключаемый_ПредставлениеКИНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	УправлениеКонтактнойИнформациейКлиентСтоматология.ПредставлениеКИНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый представление КИОчистка
//
// Параметры:
//  Элемент				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура Подключаемый_ПредставлениеКИОчистка(Элемент, СтандартнаяОбработка)
	
	УправлениеКонтактнойИнформациейКлиентСтоматология.ПредставлениеКИОчистка(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый контактная информация авто подбор
//
// Параметры:
//  Элемент					 - 	 - 
//  Текст					 - 	 - 
//  ДанныеВыбора			 - 	 - 
//  ПараметрыПолученияДанных - 	 - 
//  Ожидание				 - 	 - 
//  СтандартнаяОбработка	 - 	 - 
//
Процедура Подключаемый_КонтактнаяИнформацияАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	УправлениеКонтактнойИнформациейКлиентСтоматология.АвтоПодбор(Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый контактная информация обработка выбора
//
// Параметры:
//  Элемент				 - 	 - 
//  ВыбранноеЗначение	 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура Подключаемый_КонтактнаяИнформацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	УправлениеКонтактнойИнформациейКлиентСтоматология.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый комментарий КИПри изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура Подключаемый_КомментарийКИПриИзменении(Элемент)
	
	УправлениеКонтактнойИнформациейКлиентСтоматология.КомментарийКИПриИзменении(ЭтотОбъект, Элемент);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый контактная информация выполнить команду
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура Подключаемый_КонтактнаяИнформация_ВыполнитьКоманду(Команда)
	
	УправлениеКонтактнойИнформациейКлиентСтоматология.ВыполнитьКоманду(ЭтотОбъект, Команда);
	
КонецПроцедуры

&НаКлиенте
// Процедура - удаляет выбранную рубрику.
//
Процедура УдалитьРубрику(Команда)										
	
	УдалитьЭлементыНаСервере(Команда.Имя);
	
КонецПроцедуры

&НаСервере
// Процедура - удаляет рубрику и перестраивает динамические элементы.
//
Процедура УдалитьЭлементыНаСервере(ИмяКоманды)
	
	ИндексСтроки = СтрРазделить(ИмяКоманды,"_")[1];
	ЯндексИдентификаторРубрики.Удалить(ИндексСтроки);
	УдалитьДинамическиеЭлементы(Элементы.ГруппаРубрики, Элементы.ГруппаРубрика_Шаблон);
	ПостроитьДинамическиеЭлементы();
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
// Процедура - удаляет динамические элементы.
//
Процедура УдалитьДинамическиеЭлементы(ГруппаДляУдаления, ШаблонГруппы)
	
	МассивУдаляемых = Новый Массив;
	
	Для Каждого ЭлементГруппы Из ГруппаДляУдаления.ПодчиненныеЭлементы Цикл
		Если ЭлементГруппы <> ШаблонГруппы Тогда
			МассивУдаляемых.Добавить(ЭлементГруппы);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ЭлементФормы Из МассивУдаляемых Цикл
		Элементы.Удалить(ЭлементФормы);  
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// Процедура - создает динамические элементы.
//
Процедура ПостроитьДинамическиеЭлементы()
	
	Счетчик = 0;
	Для Каждого СтрокаТ Из ЯндексИдентификаторРубрики Цикл
		
		ГруппаФормы				 			= УправлениеИнтерфейсамиСервер.КопироватьГруппуФормы(ЭтаФорма, Элементы.ГруппаРубрика_Шаблон, Счетчик, Элементы.ГруппаРубрики);
		ДекорацияФормы			 			= УправлениеИнтерфейсамиСервер.КопироватьЭлементФормы(ЭтаФорма, Элементы.ДекорацияРубрика_Шаблон, Счетчик,, ГруппаФормы); 
		КнопкаФормы				 			= УправлениеИнтерфейсамиСервер.КопироватьКнопкуФормы(ЭтаФорма, Элементы.УдалитьРубрику_Шаблон, Счетчик, ГруппаФормы); 
		Если СтрДлина(СтрокаТ.Представление) > 31 Тогда
			ДекорацияФормы.Ширина			= 23;
			ДекорацияФормы.Высота			= 1;
		КонецЕсли;
		ДекорацияФормы.Заголовок 			= СтрокаТ.Представление;
		КнопкаФормы.Доступность				= ПравоДоступа("Редактирование", Метаданные.Справочники.СтруктурныеЕдиницы);
		
		Счетчик 							= Счетчик + 1;
		
	КонецЦикла;
	Элементы.КомандаПодобратьИдентификаторРубрики.Доступность = ПравоДоступа("Редактирование", Метаданные.Справочники.СтруктурныеЕдиницы);
	Если ЯндексИдентификаторРубрики.Количество() = 3 Тогда
		Элементы.КомандаПодобратьИдентификаторРубрики.Видимость = Ложь;
	Иначе
		Элементы.КомандаПодобратьИдентификаторРубрики.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - подбирает идентификаторы рубрик.
//
Процедура КомандаПодобратьИдентификаторРубрики(Команда)
	
	Если ЯндексИдентификаторРубрики.Количество() = 3 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нельзя выбирать больше трех рубрик!");
	Иначе
		ОткрытьФорму("Справочник.СтруктурныеЕдиницы.Форма.ФормаВыбораИдентификатораРубрики");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработка оповещения.
//
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Значение" Тогда
		
		Если ЗначениеЗаполнено(Параметр) Тогда
			ПолучитьИдентификаторИзХранилища(Параметр);
		КонецЕсли;  
		
	КонецЕсли;
	
	Если ИмяСобытия = "Запись_Файл" Тогда
		
		Если Параметр.Свойство("ВладелецФайла") И Параметр.ВладелецФайла = СтруктурнаяЕдиница Тогда
			ОтобразитьКартинки();
			Если ТипЗнч(Источник) = Тип("Массив") Тогда
				ИзображениеДляПроверки = Источник[0];
			Иначе
				ИзображениеДляПроверки = Источник;
			КонецЕсли;
			ЭтотОбъект.ФайлКартинки = ИзображениеДляПроверки;
			ПриИзмененииКартинки();
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

&НаСервере 
// Процедура - получает идентификатор рубрики из временного хранилища.
//
Процедура ПолучитьИдентификаторИзХранилища(АдресВХранилище)
	
	//НастройкиЯндексКарты = Объект.Ссылка.НастройкиЯндексКарты.Получить();
	ЭтаФорма.Модифицированность = Истина;
	
	Для Счетчик = ЯндексИдентификаторРубрики.Количество() по 2 Цикл
		
		Если ЯндексИдентификаторРубрики.Количество() = Счетчик Тогда
			Стр 						= ЯндексИдентификаторРубрики.Добавить();
			Стр.Значение 				= АдресВХранилище;
			Стр.Представление           = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(АдресВХранилище, "_")[1];
			ИД 							= Стр.ПолучитьИдентификатор(); 
			УдалитьДинамическиеЭлементы(Элементы.ГруппаРубрики, Элементы.ГруппаРубрика_Шаблон);
			ПостроитьДинамическиеЭлементы();
			Возврат
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "СохранитьКак".
//
Процедура СохранитьКак(Команда)
	
	Индекс 		 = ПолучитьИндексИмениЭлемента(ЭтаФорма.ТекущийЭлемент.Имя);
	ФайлКартинки = ЭтотОбъект.ФайлыКартинок.Получить(Индекс - 1).Значение;
	
	ДанныеФайла = ПолучитьДанныеФайла(ФайлКартинки, УникальныйИдентификатор);
	Если ДанныеФайла <> Неопределено Тогда 	
		РаботаСФайламиСлужебныйКлиент.СохранитьКак(Неопределено, ДанныеФайла, УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
// Функция, вернет индекс имени элемента.
//
Функция ПолучитьИндексИмениЭлемента(Наименование)
	
	НомерСимвола = СтрНайти(Наименование, "_");
	Возврат ?(НомерСимвола > 0, Число(Прав(Наименование, СтрДлина(Наименование) - НомерСимвола)), Неопределено);
	
КонецФункции

&НаСервереБезКонтекста
// Функция, возвращает данные файла.
//
Функция ПолучитьДанныеФайла(ФайлКартинки, УникальныйИдентификатор)
	
	Возврат РаботаСФайламиВызовСервераСтоматология.ПолучитьДанныеФайла(ФайлКартинки, УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
// Процедура, обработчик команды "УдалитьКартинку".
//
Процедура УдалитьКартинку(Команда)
	
	Индекс 		 = ПолучитьИндексИмениЭлемента(ЭтаФорма.ТекущийЭлемент.Имя);
	ФайлКартинки = ЭтотОбъект.ФайлыКартинок.Получить(Индекс - 1).Значение;
	
	Оповещение = Новый ОписаниеОповещения("ВопросОбУдаленииКартинкиЗавершение", ЭтотОбъект, ФайлКартинки);
	ПоказатьВопрос(Оповещение, "Вы действительно хотите удалить картинку?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
// Процедура - результат вопроса об удалении картинки
//
Процедура ВопросОбУдаленииКартинкиЗавершение(Результат, ФайлКартинки) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ВопросОбУдаленииКартинкиЗавершениеНаСервере(ФайлКартинки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - результат вопроса об удалении картинки на сервере
//
Процедура ВопросОбУдаленииКартинкиЗавершениеНаСервере(ФайлКартинки)
	
	ФайлКартинкиОбъект = ФайлКартинки.ПолучитьОбъект();
	ФайлКартинкиОбъект.УстановитьПометкуУдаления(Истина);
	ОтобразитьКартинки();
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

&НаСервере
// Процедура, отображает картинки номенклатуры.
//
Процедура ОтобразитьКартинки()
	
	ЭтотОбъект.ФайлыКартинок.Очистить();
	
	МассивФайловКартинок = ПолучитьВсеПодчиненныеФайлы(СтруктурнаяЕдиница);
	
	Для Индекс = 1 По 6 Цикл
		
		Если МассивФайловКартинок.Количество() >= Индекс Тогда
			ФайлКартинки = МассивФайловКартинок[Индекс - 1];
			ЭтотОбъект["АдресКартинки" + Индекс] = ПолучитьНавигационнуюСсылкуКартинки(ФайлКартинки, ЭтаФорма.УникальныйИдентификатор);
			ЭтотОбъект.ФайлыКартинок.Добавить(ФайлКартинки);
		КонецЕсли;
		
		Элементы["ПолеКартинки_" + Индекс].Видимость = МассивФайловКартинок.Количество() >= Индекс;
		
	КонецЦикла;
	
	Элементы.ГруппаКнопкиДобавитьКартинку.Видимость = (ЭтотОбъект.ФайлыКартинок.Количество() <= 5);
	
	ГруппаРодитель = ?(ЭтотОбъект.ФайлыКартинок.Количество() > 2, Элементы.ГруппаСтрокаСКартинками_2, Элементы.ГруппаСтрокаСКартинками_1);
	Элементы.Переместить(Элементы.ГруппаКнопкиДобавитьКартинку, ГруппаРодитель);
	
	Если МассивФайловКартинок.Количество() = 0 Тогда
		ЭтотОбъект.АдресКартинки1 = ПоместитьВоВременноеХранилище(БиблиотекаКартинок.ПросмотрНедоступен.ПолучитьДвоичныеДанные(), ЭтаФорма.УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

// Получает все подчиненные файлы.
//
// Параметры:
//   ВладелецФайла - ЛюбаяСсылка - владелец файла.
//
// Возвращаемое значение:
//   Массив из СправочникСсылка.Файлы - массив файлов.
//
Функция ПолучитьВсеПодчиненныеФайлы(ВладелецФайла)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Файлы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Файлы КАК Файлы
	|ГДЕ                     
	|	Файлы.ВладелецФайла = &ВладелецФайла
	|	И НЕ Файлы.ПометкаУдаления
	|	И (ВЫРАЗИТЬ(Файлы.Описание КАК СТРОКА(100))) = ""КартинкаЯндексСалон""");
	
	Запрос.УстановитьПараметр("ВладелецФайла", ВладелецФайла);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаСервереБезКонтекста
// Функция возвращает навигационную ссылку картинки
//
Функция ПолучитьНавигационнуюСсылкуКартинки(ФайлКартинки, ИдентификаторФормы)
	
	УстановитьПривилегированныйРежим(Истина);
	//Возврат РаботаСФайламиСлужебныйВызовСервера.ПолучитьНавигационнуюСсылкуВоВременномХранилище(ФайлКартинки.ТекущаяВерсия);
	
	СсылкаНаДвоичныеДанные = РаботаСФайламиВызовСервераСтоматология.СсылкаНаДвоичныеДанныеФайла(ФайлКартинки, ИдентификаторФормы);
	Возврат ?(СсылкаНаДвоичныеДанные = Неопределено, "", СсылкаНаДвоичныеДанные);
	
КонецФункции

&НаКлиенте
// Процедура, обработчик команды "ДобавитьКартинку".
//
Процедура ДобавитьКартинку(Команда)
	
	# Если НЕ ВебКлиент Тогда
		Если Не ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда
			Оповещение = Новый ОписаниеОповещения("ВопросОЗаписиОбъектаЗавершение", ЭтотОбъект);
			ПоказатьВопрос(Оповещение, "Для продолжения операции необходимо записать элемент, записать?", РежимДиалогаВопрос.ДаНет);
		Иначе
			ВставитьИзФайлаОбработка("КартинкаЯндексСалон");
		КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик завершения
//
Процедура ВопросОЗаписиОбъектаЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Если Объект.ИспользоватьЯндексКарты Тогда
			Объект.ИспользоватьЯндексКарты = Ложь;
			ЭтотОбъект.Записать();
			Объект.ИспользоватьЯндексКарты = Истина;
		Иначе
			ЭтотОбъект.Записать();
		КонецЕсли;
		ВставитьИзФайлаОбработка("КартинкаЯндексСалон");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Вставить из файла обработка
// Завершение процедуры Вставить из файла ответ
Процедура ВставитьИзФайлаОбработка(ТипКартинки)
	
	ИдентификаторФайла = Новый УникальныйИдентификатор;
	
	Фильтр = НСтр("ru = 'Все картинки (*.bmp;*.gif;*.png;*.jpeg;*.dib;*.rle;*.tif;*.jpg;*.ico;*.wmf;*.emf)|*.bmp;*.gif;*.png;*.jpeg;*.dib;*.rle;*.tif;*.jpg;*.ico;*.wmf;*.emf"
	+ "|Все файлы(*.*)|*.*"
	+ "|Формат bmp(*.bmp*;*.dib;*.rle)|*.bmp;*.dib;*.rle"
	+ "|Формат GIF(*.gif*)|*.gif"
	+ "|Формат JPEG(*.jpeg;*.jpg)|*.jpeg;*.jpg"
	+ "|Формат PNG(*.png*)|*.png"
	+ "|Формат TIFF(*.tif)|*.tif"
	+ "|Формат icon(*.ico)|*.ico"
	+ "|Формат метафайл(*.wmf;*.emf)|*.wmf;*.emf'");
	
	РаботаСФайламиКлиент.ДобавитьФайлы(СтруктурнаяЕдиница, ИдентификаторФайла, Фильтр,,, ТипКартинки);
	ЭтаФорма.Модифицированность = Истина;
	
	
КонецПроцедуры

&НаСервере
// Процедура, устававливает видимость картинки
//
Процедура ПриИзмененииКартинки()
	
	Видимость = Не ЭтотОбъект.ФайлКартинки.Пустая();
	
	Если Видимость Тогда
		АдресКартинки = ПолучитьНавигационнуюСсылкуКартинки(ЭтотОбъект.ФайлКартинки, УникальныйИдентификатор);
		//Элементы.АдресКартинки.РазмерКартинки = РазмерКартинки.Пропорционально;
	Иначе
		АдресКартинки = ПоместитьВоВременноеХранилище(БиблиотекаКартинок.ВашЛоготип.ПолучитьДвоичныеДанные(), УникальныйИдентификатор);
		//Элементы.АдресКартинки.РазмерКартинки = РазмерКартинки.РеальныйРазмер;
	Конецесли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - использовать яндекс карты при изменении
//
Процедура ИспользоватьЯндексКартыПриИзменении(Элемент)
	
	ЭтаФорма.Модифицированность = Истина;
	Элементы.ГруппаЯндексИдентификаторРубрики.Видимость = ИспользоватьЯндексКарты;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "Нажатие".
//
Процедура ПолеКартинкиНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Индекс 		 = ПолучитьИндексИмениЭлемента(Элемент.Имя);
	ФайлКартинки = ЭтотОбъект.ФайлыКартинок.Получить(Индекс - 1).Значение;
	
	ОткрытьКартинку(ФайлКартинки);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "Нажатие".
//
Процедура ОсновнаяКартинкаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЭтотОбъект.ФайлыКартинок.Количество() > 0 Тогда
		ОткрытьКартинку(ЭтотОбъект.ФайлыКартинок.Получить(0).Значение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, открывает картинку.
//
Процедура ОткрытьКартинку(ФайлКартинки)
	
	ДанныеФайла = ПолучитьДанныеФайла(ФайлКартинки, ЭтаФорма.УникальныйИдентификатор);
	Если ДанныеФайла <> Неопределено Тогда 		
		РаботаСФайламиКлиент.ОткрытьФайл(ДанныеФайла);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработка выбора СЕ.
//
Процедура СтруктурнаяЕдиницаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Объект.СтруктурнаяЕдиница = СтруктурнаяЕдиница;
КонецПроцедуры

 &НаКлиенте
 // Процедура обработчик коменты: Удалить, Помечает на удаление текущую внешнюю систему
 //
 Процедура УдалитьИЗакрыть(Команда)
	 
	 Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса",
	 ЭтотОбъект);	
	 
	 ПоказатьВопрос(Оповещение,
	 "Вы точнохотите пометить на удаление данный элемент справочника?",
	 РежимДиалогаВопрос.ДаНетОтмена,
	 0, 
	 КодВозвратаДиалога.Да
	 );    
	 
	 
 КонецПроцедуры
 
 &НаКлиенте
 // Процедура, помечает внешнюю систему на удаление или снимает пометку.
 //
 Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	 
	 Если Результат = КодВозвратаДиалога.Да Тогда
		 
		 ПометитьНаУдаление();
		 
		 ПараметрыОповещения = Новый Структура;
		 ПараметрыОповещения.Вставить("ВнешняяСистема"	, Объект.Ссылка);
		 ПараметрыОповещения.Вставить("ТипВнешнейСистемы", Объект.ТипВнешнейСистемы);
		 
		 Оповестить("УдаленаВнешняяСистема", ПараметрыОповещения);
		 
		 ЭтаФорма.Закрыть();
	 КонецЕсли;	
	 
 КонецПроцедуры 
 
 &НаСервере
 // Процедура, помечает внешнюю систему на удаление или снимает пометку.
 //
 Процедура ПометитьНаУдаление()
	 
	 ВнешняяСистемаОбъект = Объект.Ссылка.ПолучитьОбъект();
	 ВнешняяСистемаОбъект.ПометкаУдаления = Истина;
	 ВнешняяСистемаОбъект.Используется = Ложь;
	 
	 Попытка
		 ВнешняяСистемаОбъект.Записать();
	 Исключение 
	 КонецПопытки;
	 
 КонецПроцедуры
